In [1]:
import pandas as pd

In [6]:
x=pd.Series(['apple','ball','cat','dog','egg','fox'],index=['a','b','c','d','e','f'])
print(x)

a    apple
b     ball
c      cat
d      dog
e      egg
f      fox
dtype: object

In [13]:
date = pd.date_range(start='05-01-2021', end='05-13-2021')
print(date)

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12',
               '2021-05-13'],
              dtype='datetime64[ns]', freq='D')

In [14]:
data={'name':['abc','cde','efg'],'roll_no':[1,2,3]}
print(pd.DataFrame.from_dict(data))

  name  roll_no
0  abc        1
1  cde        2
2  efg        3

In [17]:
l=[['apple','fruit'],['cat','animal'],['crow','bird']]
print(pd.DataFrame(l,columns=['A','B']))

       A       B
0  apple   fruit
1    cat  animal
2   crow    bird

In [32]:
df = pd.read_csv('networks.csv')
print(df)

               kdrama_name original_networks
0       100 Days My Prince               tvN
1         12 Signs of Love               tvN
2         12 Years Promise              jTBC
3                 18 Again              jTBC
4     365: Repeat the Year               MBC
...                    ...               ...
1447  Your Neighbor's Wife              jTBC
1448                 Youth               NaN
1449          Youth of May               KBS
1450          Yumi's Cells               tvN
1451      Zombie Detective               KBS

[1452 rows x 2 columns]

In [31]:
print(df.sort_values(by = 'kdrama_name'))

               kdrama_name original_networks
9                   #Alive     Naver TV Cast
0       100 Days My Prince               tvN
1         12 Signs of Love               tvN
2         12 Years Promise              jTBC
3                 18 Again              jTBC
...                    ...               ...
1447  Your Neighbor's Wife              jTBC
1448                 Youth               NaN
1449          Youth of May               KBS
1450          Yumi's Cells               tvN
1451      Zombie Detective               KBS

[1452 rows x 2 columns]

In [17]:
import pandas as pd
data = pd.read_csv('newexe4.csv')
index = {'a','b','c','d','e'}
df = pd.DataFrame(data,index)
df.reset_index(inplace =True)
df

  index  rollno name  age
0     e     NaN  NaN  NaN
1     d     NaN  NaN  NaN
2     b     NaN  NaN  NaN
3     a     NaN  NaN  NaN
4     c     NaN  NaN  NaN

In [18]:
import pandas as pd
record = pd.read_csv('newexe4.csv')
df = pd.DataFrame(record)
df1=df.head(2)
df1

   rollno   name  age
0       1   Anju   22
1       2  Gouri   21

In [24]:
import pandas as pd
record = pd.read_csv('exe4new2.csv')
avg = record.groupby('occ')['salary'].mean()
print(avg)

occ
doctor      40000
engineer    30000
teacher     33000
Name: salary, dtype: int64

In [42]:
import pandas as pd
data = pd.read_csv('newexe4.csv')
index = {'a','b','c','d','e'}
df = df.fillna(0)
df

   rollno  name  age
e     0.0     0  0.0
d     0.0     0  0.0
b     0.0     0  0.0
a     0.0     0  0.0
c     0.0     0  0.0

In [44]:
import pandas as pd
data = pd.read_csv('exe4new3.csv')
print()
data['profit'] = data['profit'].apply(lambda x:x>0)
print(data)

                cname  profit
0           shyam&co.   False
1  sharma enterprises    True
2          A&C stores   False
3       BB Furnitures    True

In [48]:
import pandas as pd
data1 = pd.read_csv('exe4new4.csv')
data2 = pd.read_csv('exe4new5.csv')
dataframe = pd.merge(data1,data2,how ='inner',on ='eid')
print(dataframe)

   eid    ename  stipend         position
0    1     anju     2000         employee
1    2      anu     4000         employee
2    3     malu     1500           intern
3    4  arunima     3000  senior_employee